// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.WriteLine("Введите целое число");
int numN = Convert.ToInt32(Console.ReadLine());
// int num = 1;

for (int num = 1; num < numN; num++)
{
    if (num % 2 == 0);

    Console.WriteLine($"Четные числа от 1 до" + numN + " : " + num);
    
    else if (num++);

    }





